tukano-artillery-tests/logs/delete-5-hibernate.txt
--------------------------------
Summary report @ 19:09:23(+0000)
--------------------------------

http.codes.200: ................................................................ 150
http.downloaded_bytes: ......................................................... 12882
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 31
  max: ......................................................................... 1027
  mean: ........................................................................ 83.9
  median: ...................................................................... 47.9
  p95: ......................................................................... 237.5
  p99: ......................................................................... 645.6
http.response_time.2xx:
  min: ......................................................................... 31
  max: ......................................................................... 1027
  mean: ........................................................................ 83.9
  median: ...................................................................... 47.9
  p95: ......................................................................... 237.5
  p99: ......................................................................... 645.6
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 150
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 31
  max: ......................................................................... 1027
  mean: ........................................................................ 83.9
  median: ...................................................................... 47.9
  p95: ......................................................................... 237.5
  p99: ......................................................................... 645.6
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 197.9
  max: ......................................................................... 5270.7
  mean: ........................................................................ 706.5
  median: ...................................................................... 219.2
  p95: ......................................................................... 3752.7
  p99: ......................................................................... 4867