tukano-artillery-tests/logs/delete-nosql-15.txt
--------------------------------
Summary report @ 12:34:55(+0000)
--------------------------------

http.codes.204: ................................................................ 450
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 419
  max: ......................................................................... 613
  mean: ........................................................................ 446.1
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 539.2
http.response_time.2xx:
  min: ......................................................................... 419
  max: ......................................................................... 613
  mean: ........................................................................ 446.1
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 539.2
http.responses: ................................................................ 450
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.204: ........ 450
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 419
  max: ......................................................................... 613
  mean: ........................................................................ 446.1
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 539.2
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 847.6
  max: ......................................................................... 1344.6
  mean: ........................................................................ 897.2
  median: ...................................................................... 871.5
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1200.1