tukano-artillery-tests/logs/delete-nosql-33.txt
--------------------------------
Summary report @ 18:39:40(+0000)
--------------------------------

http.codes.204: ................................................................ 990
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 416
  max: ......................................................................... 1625
  mean: ........................................................................ 537.1
  median: ...................................................................... 468.8
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1436.8
http.response_time.2xx:
  min: ......................................................................... 416
  max: ......................................................................... 1625
  mean: ........................................................................ 537.1
  median: ...................................................................... 468.8
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1436.8
http.responses: ................................................................ 990
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.204: ........ 990
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 416
  max: ......................................................................... 1625
  mean: ........................................................................ 537.1
  median: ...................................................................... 468.8
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1436.8
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 845.3
  max: ......................................................................... 2395.7
  mean: ........................................................................ 1001.2
  median: ...................................................................... 907
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 2186.8