tukano-artillery-tests/logs/delete-nosql-5.txt
--------------------------------
Summary report @ 12:16:02(+0000)
--------------------------------

http.codes.204: ................................................................ 150
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 432
  max: ......................................................................... 480
  mean: ........................................................................ 443.6
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 459.5
http.response_time.2xx:
  min: ......................................................................... 432
  max: ......................................................................... 480
  mean: ........................................................................ 443.6
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 459.5
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.204: ........ 150
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 432
  max: ......................................................................... 480
  mean: ........................................................................ 443.6
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 459.5
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 859.4
  max: ......................................................................... 1075.6
  mean: ........................................................................ 891.7
  median: ...................................................................... 889.1
  p95: ......................................................................... 925.4
  p99: ......................................................................... 925.4